"""
6. Напишіть програму, яка перевіряє, чи відповідає пароль для сайту вашим вимогам.
Напишіть самостійно список вимог до паролю (наявність великої букви,
спеціальних символів, чисел, пароль має бути довший 8 символів і тд) і перевірте, чи введений пароль сформований вірно."""


"""Task 1.
Реалізуйте функціонал генерування пошт для компанії "kobzar.com", де користувач повинен самостійно вводити своє ім'я і 
прізвище з терміналу.
"""

#
x = input("Please enter your name: ")
y = input("Please enter your surname: ")
domain = ("@kobzar.com")
print(x + y + domain)
print(x[0:2] + y[0:2] + domain)

""""""
"""
Task 2.
Ви - настирливий продавець і коли хтось відвідує ваш сайт онлайн-магазину, ви запитуєте 5 разів у користувача, 
чи потрібно йому передзвонити. На 6-ий раз ви нарешті лишаєте покупця в спокої і бажаєте йому гарних покупок.
"""
#

n = 0

while n <5:
    print("Вам Потрібно передзвонити?")
    n+=1
    if n>5:
        break
print("Гарного вам дня, щастя, здоров'я, гарних покупок і багато грошей щоб купити всі чіпси в атб")




"""
Task 3. Ви - тепер ще більш настирливий продавець і коли користувач відвідує ваш сайт, ви прямо таки постійно питаєте у нього, 
чи потрібно йому передзвонити для формування замовлення. Допоки користувач не натиснув кнопку "ні, дякую", ви постійно нагадуватимете йому про дзвінок.
*під натисканням кнопки ми зараз маємо на увазі ввід користувача з терміналу
"""

while True:
    x = input("Чи вам потрібно передзвонити для формування замовлення на чіпси своя лінія в розсрочку?: ")
    if (x.lower() == "ні"):
        break
while True: 
    y = input("Дякуємо за ваш брак зацікавленості, можливо ви б хотіли чорний перець в іпотеку?: ")
    if (y.lower() == "ні"):
        break
while True:   
        z = input("Чому?: ")
        if (z.lower() == "тому") or (z.lower() == "бо так"):
            break


"""Task 4. Ви - власник онлайн магазину канцтоварів. Кожному 3-му покупцю ви обіцяєте в подарунок ручку до замовлення,а 
кожному 5-му - лінійку.
*розгляньте випадок, коли покупець може бути і 3-ій і 5-им (75-ий покупець, до прикладу).
*для проходження по всій кількості покупців використайте range() ф-ю в циклі for. Кількість покупців ви можете задати вручну, 
або скористатись ф-єю input() і ввести к-сть з терміналу
*Додайте функціонал на випадок, якщо користувач промахнувся по клавіатурі і ввів замість числа якусь абракадабру (ф-я isdigit())"""


customer_num = input("Введіть вашу кількість покупців:")
converted_num = int(customer_num)
for i in range(1, converted_num):
    if i%3==0 and i%5==0:
        print(f"Вітаю, ви {i} покупець, тому ви отримуєте ссилку на список математичних парадоксів")
    if i%3==0:
        print(f'Вітаю, ви {i} покупець, тому ви отримаєте ручку!')
    if i%5==0:
        print(f'Вітаю, ви {i} покупець, тому ви отримаєте лінійку!')

"""Task 5. Створіть програму, яка перевіряє, чи може користувач отримати кредит в банку. Запитайте у користувача про його дохід,
вік та наявність роботи. Врахуйте різні умови, такі як мінімальний дохід, мінімальний/максимальний вік та наявність роботи.
Мінімальний дохід, мінімальний/максимальний вік задайте самостійно."""
#
